Revit 2026 API

# Transform1DAssign Method

---

Assigns values from the input transformation to this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	Transform1D from
)
```
```vb
Public Sub Assign (
	from As Transform1D
)
```
```cpp
public:
void Assign(
	Transform1D^ from
)
```
```fsharp
member Assign :
        from : Transform1D -> unit
```

#### Parameters

from Transform1D
     The transformation to use as input.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace